// 1) Знайти суму та кількість позитивних елементів.
// сума всіх елементів
// let arr = [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
// let res = arr.reduce(function(sum, elem) {
// 	return sum + elem;
// }, 0);
// console.log(res);

// сума позитивних елементів
let arr = [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let res = arr.reduce(function(sum, elem) {
    if (elem >= 0) {
        return sum + elem;
    } else {
        return sum;
    }
});
console.log(res);

//кількість позитивних елементів
let arr2 = [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let positive = arr2.filter(elem => (elem>0));
console.log(positive.length);


// 2) Знайти мінімальний елемент масиву та його порядковий номер, спосіб "spread" (...arr)
let arr3 = [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let min = Math.min(...arr3);
console.log(min);
console.log(arr3.indexOf(-63));

// 3) Знайти максимальний елемент масиву та його порядковий номер.
let arr4 = [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let max = Math.max(...arr4);
console.log(max);
console.log(arr4.indexOf(76));

// 4) Визначити кількість негативних елементів
let arr5 = [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let negative = arr5.filter(elem =>(elem<0));
console.log(negative.length);

// 5) Знайти кількість непарних позитивних елементів
